#+title:      A Klasse 2020-24
#+date:       [2022-12-28 Mi 20:45]
#+filetags:   :4a:Project:
#+identifier: 20221228T204513
#+CATEGORY: golling
#+LANGUAGE: de
#+BIBLIOGRAPHY: ~/RoamNotes/references/Literatur.bib
#+TODO: TODO(t) STARTED(s!) WAITING(w@/!) APPT(a) PROJ(p) NOTIZ(n) NEXT(x) BESPROCHEN(b) DELEGATED(g@/!) | DONE(d!) CANCELED(c@)
#+SETUPFILE: ~/RoamNotes/config/latex_setup.org
#+ATTR_LATEX: :environment tabularx :placement [h] :center t :width \linewidth
#+OPTIONS: toc:nil
#+export_file_name: ~/RoamNotes/exports/4a.html
#+AUTHOR: Matthias Fuchs
#+EMAIL: matthiasfuchs01@gmail.com

* 4A [KV Magdalena Pürrer]

#+Name: 2021-students
| First      | Last        | Name                  | Note | Mitarbeit | Heft | LZK |
|------------+-------------+-----------------------+------+-----------+------+-----|
| Stefan     | Gonschorek  | [[Stefan Gonschorek][Stefan Gonschorek]]     |    1 |           |      |     |
| Manuel     | Irrnberger  | [[Manuel Irrnberger][Manuel Irrnberger]]     |    1 |           |      |     |
| Tobias     | Kappel      | [[Tobias Kappel][Tobias Kappel]]         |    1 |           |      |     |
| Luis       | Korten      | [[Luis Korten][Luis Korten]]           |    1 |           |      |     |
| Adrian     | Lamprecht   | [[Adrian Lamprecht][Adrian Lamprecht]]      |    1 |           |      |     |
| Noah       | Linhuber    | [[Noah Linhuber][Noah Linhuber]]         |    1 |           |      |     |
| Hanna      | Maier       | [[Hanna Maier][Hanna Maier]]           |    1 |           |      |     |
| Melissa    | Neudorfer   | [[Melissa Neudorfer][Melissa Neudorfer]]     |    1 |           |      |     |
| Arthur     | Schattauer  | [[Arthur Schattauer][Arthur Schattauer]]     |    1 |           |      |     |
| Fabian     | Schober     | [[Fabian Schober][Fabian Schober]]        |    1 |           |      |     |
| Kristina   | Seidl       | [[Kristina Seidl][Kristina Seidl]]        |    1 |           |      |     |
| Anna       | Steiner     | [[Anna Steiner][Anna Steiner]]          |    1 |           |      |     |
| Andre-Leon | Stippler    | [[Andre-Leon Stippler][Andre-Leon Stippler]]   |    1 |           |      |     |
| Nico       | Straßer     | [[Nico Straßer][Nico Straßer]]          |      |           |      |     |
| Emma       | Sunkler     | [[Emma Sunkler][Emma Sunkler]]          |      |           |      |     |
| Christina  | Unterrainer | [[Christina Unterrainer][Christina Unterrainer]] |    1 |           |      |     |
| Thomas     | Wenger      | [[Thomas Wenger][Thomas Wenger]]         |    1 |           |      |     |
| Lena       | Zorzi       | [[Lena Zorzi][Lena Zorzi]]            |    1 |           |      |     |
#+TBLFM: $4=vmean($5..$>)
#+TBLFM: $3='(concat "[[" $1 " " $2 "][" $1 " " $2 "]]")
#+TBLFM: $5='(identity remote(2021-22-Mitarbeit,@@#$2))

#+BEGIN_SRC python :var table=2021-students :results output raw
  print('* Mitarbeit')
  for student in table:
      first = student[0]
      last = student[1]
      email = first + '.' + last + '@golling.schule'
      print('** ' + first + ' ' + last + '')
      print(':PROPERTIES:')
      print(':EMAIL: ' '[[mailto: ' + first + ' ' + last + ' <' + email + '>]]')
      print(':EXPORT_FILE_NAME: ' '~/RoamNotes/exports/'  + first +  '_'  + last +  '.html')
      print(':END: ')
      print('\n')
      print('|-----------------------+-----------+-------------------------+---------------|')
      print('| Datum / UE            | Stunde    | Thema                   | Anmerkungen   |')
      print('|-----------------------+-----------+-------------------------+---------------|')
      print('\n')
      print('*** Note ' + first + ' ' + last)
      print('|-----------+-------------+-----+-----------+------------|')
      print('| Mitarbeit | Heft / Buch | LZK | Sonstiges | Gesamtnote |')
      print('|-----------+-------------+-----+-----------+------------|')
      print('|         2 |           3 |   2 |         3 |        2.5 |')
      print('#+TBLFM: $5=vmean($1..$4)')
      print('\n')
#+END_SRC

#+RESULTS:
